cf_billing/Documents/энргПерерасчетМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргПерерасчетМКД</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргОбъемСубсидий</xr:Item>
				<xr:Item>AccumulationRegister.энргОбъемНачислений</xr:Item>
				<xr:Item>AccumulationRegister.энргОбъемНачисленийМКД</xr:Item>
				<xr:Item>AccumulationRegister.бестОбъемНачисленийНП</xr:Item>
				<xr:Item>AccumulationRegister.энргНачисленныйСреднийОбъемМКД</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СвязанныйПерерасчет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МКД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокументаОснования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.энргСменаПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.энргОперацияСУслугами</v8:Type>
								<v8:Type>cfg:DocumentRef.энргОперацияСЛицевымСчетом</v8:Type>
								<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчета</v8:Type>
								<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатков</v8:Type>
								<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
								<v8:Type>cfg:DocumentRef.энргОбходнойЛист</v8:Type>
								<v8:Type>cfg:DocumentRef.энргКвитанция</v8:Type>
								<v8:Type>cfg:DocumentRef.энргУстановитьДатуПоверкиПУ</v8:Type>
								<v8:Type>cfg:DocumentRef.энргПоступлениеОплатыЧерезКонтроллера</v8:Type>
								<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
								<v8:Type>cfg:DocumentRef.энргРегистрацияПоказанийАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемУслуги</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчетаМКД</v8:Type>
								<v8:Type>cfg:DocumentRef.энргОткрытиеМКД</v8:Type>
								<v8:Type>cfg:DocumentRef.энргСменаПоставщикаМКД</v8:Type>
								<v8:Type>cfg:DocumentRef.энргОперацияСУслугамиМКД</v8:Type>
								<v8:Type>cfg:DocumentRef.энргУстановитьЗначениеПлощадиМКД</v8:Type>
								<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатковМКД</v8:Type>
								<v8:Type>cfg:DocumentRef.энргУстановитьВидДифференцированностиПриборУчетаМКД</v8:Type>
								<v8:Type>cfg:DocumentRef.энргУстановитьВидБлагоустройстваМКД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КорректировкаПоказаний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотДо</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотПосле</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияПосле</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчетаДо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчетаПосле</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разделитель</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистраторПоказаний</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.энргОперацияСУслугами</v8:Type>
								<v8:Type>cfg:DocumentRef.энргОперацияСЛицевымСчетом</v8:Type>
								<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчета</v8:Type>
								<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатков</v8:Type>
								<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
								<v8:Type>cfg:DocumentRef.энргОбходнойЛист</v8:Type>
								<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.энргПоступлениеОплатыЧерезКонтроллера</v8:Type>
								<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
								<v8:Type>cfg:DocumentRef.энргРегистрацияПоказанийАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказанийДо</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказанийПосле</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗонаДо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗонаПосле</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШкалаДо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШкалаПосле</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КСДо</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КСПосле</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргРаспределениеМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргРаспределениеМКД</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргОбъемСубсидий</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансыИспользованные</xr:Item>
				<xr:Item>AccumulationRegister.энргОбъемНачислений</xr:Item>
				<xr:Item>AccumulationRegister.энргОтрицательныйОбъемРаспределенияМКД</xr:Item>
				<xr:Item>AccumulationRegister.энргОбъемНачисленийПомещенийСРазделеннымиЛС</xr:Item>
				<xr:Item>AccumulationRegister.бестОбъемНачисленийНП</xr:Item>
				<xr:Item>AccumulationRegister.энргОбъемНачисленийСверхнормативаМКД</xr:Item>
				<xr:Item>AccumulationRegister.энргНачисленныйСреднийОбъем</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансыПоступившие</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчетыПоМесяцам</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансы</xr:Item>
				<xr:Item>AccumulationRegister.бестОбъемНачисленийЭлектроэнергии</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьРаспределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргПерерасчетМКД/Forms/ФормаДокументаКорректировкаПотребленногоОбъема/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления 			= Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ПересчитатьИндивидуальныйОбъемПотребленный(Команда)
	
	 ПересчитатьСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ПересчитатьСервер()

	ОчиститьНаборыЗаписей();
	
	ОбъемНачисленийМКД 		= Объект.Движения.энргОбъемНачисленийМКД.Выгрузить();
	мУслуги 				= Новый Массив;
	ГраницыПерерасчета = Новый Структура("Начало,Окончание", Неопределено, Неопределено);
	ДанныеПерерасчета(ГраницыПерерасчета, мУслуги);
	СнятьОбъемИндивидуальныйОбъемПотребленный(ГраницыПерерасчета, мУслуги);
	СнятьОбъемПотребленныйМКД(ГраницыПерерасчета, мУслуги);
	
	ПараметрыПерерасчета 	= Новый Структура;
	ПараметрыПерерасчета.Вставить("Начало", 			ГраницыПерерасчета.Начало);
	ПараметрыПерерасчета.Вставить("Окончание", 			ГраницыПерерасчета.Окончание);
	ПараметрыПерерасчета.Вставить("ОбъемНачисленийМКД", ОбъемНачисленийМКД);
	ПараметрыПерерасчета.Вставить("ОбъемНачислений", 	Объект.Движения.энргОбъемНачислений);
	ПараметрыПерерасчета.Вставить("ОбъемНачисленийНП", 	Объект.Движения.бестОбъемНачисленийНП);
	
	энргНачисления.ПересчитатьРаспредениеОбъемаПотребленногоМКД(Объект.Организация,Объект.ПериодНачисления, Объект.Район, Объект.МКД, ПараметрыПерерасчета);
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаборыЗаписей()
	
	СтрокиУдалить 			= Новый Массив;
	
	Для Каждого СтрокаНабора Из Объект.Движения.энргОбъемНачисленийМКД Цикл
		Если СтрокаНабора.ОбъемУслугиПотребленный < 0 Тогда
			  СтрокиУдалить.Добавить(СтрокаНабора);
		КонецЕсли;
	КонецЦикла;
	
	Для Сч = 0 По СтрокиУдалить.ВГраница() Цикл
		Объект.Движения.энргОбъемНачисленийМКД.Удалить(СтрокиУдалить[Сч]);
	КонецЦикла;
	
	Объект.Движения.энргОбъемНачислений.Очистить();
	Объект.Движения.бестОбъемНачисленийНП.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура СнятьОбъемИндивидуальныйОбъемПотребленный(ГраницыПерерасчета, мУслуги)
	
	Текст = 
	"ВЫБРАТЬ
	|	энргОбъемНачислений.*
	|ИЗ
	|	РегистрНакопления.энргОбъемНачислений КАК энргОбъемНачислений
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(энргОбъемНачислений.Период,МЕСЯЦ) МЕЖДУ &ГраницыПерерасчетаНачало И &ГраницыПерерасчетаОкончание
	|	И энргОбъемНачислений.Организация = &Организация	
	|	И энргОбъемНачислений.Район = &Район
	|	И энргОбъемНачислений.Строение = &Строение
	|	И энргОбъемНачислений.Регистратор Ссылка Документ.энргРаспределениеМКД
	|	И энргОбъемНачислений.Услуга в (&мУслуги)";
	
	Запрос  								= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("ГраницыПерерасчетаНачало", 		ГраницыПерерасчета.Начало);
	Запрос.УстановитьПараметр("ГраницыПерерасчетаОкончание", 	ГраницыПерерасчета.Окончание);
	Запрос.УстановитьПараметр("Организация", 					Объект.Организация);
	Запрос.УстановитьПараметр("Район", 							Объект.Район);
	Запрос.УстановитьПараметр("Строение",	 					Объект.МКД);
	Запрос.УстановитьПараметр("мУслуги",	 					мУслуги);
	
	Набор 									= Объект.Движения.энргОбъемНачислений;
	Выборка 								= Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока  			= Набор.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ОбъемУслугиПотребленный = -НоваяСтрока.ОбъемУслугиПотребленный;
		НоваяСтрока.ОбъемУслуги 			= 0;
		НоваяСтрока.Сумма 					= 0;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СнятьОбъемПотребленныйМКД(ГраницыПерерасчета, мУслуги)
	
	Текст 									= 
	"ВЫБРАТЬ
	|*
	|ИЗ
	|	РегистрНакопления.энргОбъемНачисленийМКД КАК энргОбъемНачислений
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(энргОбъемНачислений.Период,МЕСЯЦ) МЕЖДУ &ГраницыПерерасчетаНачало И &ГраницыПерерасчетаОкончание
	|	И энргОбъемНачислений.Организация = &Организация
	|	И энргОбъемНачислений.Район = &Район
	|	И энргОбъемНачислений.МКД = &МКД
	|	И энргОбъемНачислений.Услуга в (&мУслуги)";
	
	Запрос  								= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("ГраницыПерерасчетаНачало", 		ГраницыПерерасчета.Начало);
	Запрос.УстановитьПараметр("ГраницыПерерасчетаОкончание", 	ГраницыПерерасчета.Окончание);
	Запрос.УстановитьПараметр("Организация",	 				Объект.Организация);
	Запрос.УстановитьПараметр("Район", 							Объект.Район);
	Запрос.УстановитьПараметр("МКД", 							Объект.МКД);
	Запрос.УстановитьПараметр("мУслуги", 						мУслуги);

	Набор  									= Объект.Движения.энргОбъемНачисленийМКД;
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока  						= Набор.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ОбъемУслуги 			= 0;
		НоваяСтрока.ОбъемУслугиНорматив 	= 0;
		НоваяСтрока.ОбъемУслугиПотребленный = -Выборка.ОбъемУслугиПотребленный;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДанныеПерерасчета(ГраницыПерерасчета, мУслуги)
	
	Для Каждого СтрокаПериода Из Объект.Движения.энргОбъемНачисленийМКД Цикл
		
		Если мУслуги.Найти(СтрокаПериода.Услуга) = Неопределено Тогда
			мУслуги.Добавить(СтрокаПериода.Услуга);
		КонецЕсли;		
		
		Если ГраницыПерерасчета.Начало = Неопределено Тогда
			ГраницыПерерасчета.Начало = СтрокаПериода.ПериодНачисления;
		ИначеЕсли ГраницыПерерасчета.Начало > СтрокаПериода.ПериодНачисления Тогда 
			ГраницыПерерасчета.Начало = СтрокаПериода.ПериодНачисления;
		КонецЕсли;
		
		Если ГраницыПерерасчета.Окончание = Неопределено Тогда
			ГраницыПерерасчета.Окончание = СтрокаПериода.ПериодНачисления;
		ИначеЕсли ГраницыПерерасчета.Окончание < СтрокаПериода.ПериодНачисления Тогда 
			ГраницыПерерасчета.Окончание = СтрокаПериода.ПериодНачисления;
		КонецЕсли;		
	КонецЦикла;	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
